print('start code')#вывод строки
books = [#создаем список, содержащий словари с информацей о книгах
 {"title":"Гордость и предубеждение",
    "author": "Джейн Остен",
    "year":1813 },

   {"title":"Оно",
    "author": "Стивен Кинг",
    "year": 1986 },

    {"title": "Чужеземец" ,
    "author": "Диана Гэблдон",
    "year": 1991 },

    {"title":"451 градус по Фаренгейту",
    "author": "Рэй Брэдбери",
    "year":1953 },
    
    {"title":"Убить пересмешника",
    "author": "Харпер Ли",
    "year": 1960 }
]
for i in range(len(books)):#цикл для перебора словаря
    print(f"--------Книга {i+1}--------")#выводим номер книги
    print(f"Название: {books[i]["title"]}, Автор: {books[i]["author"]}")#выводим нахвание и автора
    print(f"--------{books[i]["year"]}--------")    #выводим год написания
print("end code")    #вывод строки 